W6/D3/routes_and_controllers/routes_and_controllers/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))

        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "walker"], ["email", "walker@aa.io"], ["created_at", "2020-10-28 22:16:01.988120"], ["updated_at", "2020-10-28 22:16:01.988120"]]

    def update
        user = User.find(params[:id])
        if user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "sam"], ["updated_at", "2020-10-28 22:35:47.708837"], ["id", 3]]