W8/D1/reddit_on_rails/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testpostsmaker"], ["description", "postmaker gogogo"], ["moderator_id", 3], ["created_at", "2020-11-10 00:11:23.418360"], ["updated_at", "2020-11-10 00:11:23.418360"]]

    def destroy
        sub = Sub.find_by(id: params[:id])
        sub.destroy!
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 4]]

    def ensure_moderator
        sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]