W11/D1/todos/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
    def index
        todos = Todo.all