W8/D1/reddit_on_rails/app/views/subs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
<h3> Description: <%= @sub.description %></h3>
<h4> Moderator Overlord: <%= User.find(@sub.moderator_id).username %></h4>