W6/D5/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2023-06-08"], ["color", "Brown"], ["name", "miles"], ["created_at", "2020-10-30 23:43:09.900532"], ["updated_at", "2020-10-30 23:43:09.900532"], ["sex", "M"]]
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save