W6/D4/art_share_api/art_share_api/app/controllers/artwork_shares_controller.rb

    def destroy
        artwork_share = ArtworkShare.find_by(id: params[:id])

        if artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]