W6/D4/art_share_api/art_share_api/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT artworks.* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "users"."id" = $1  [["id", "1"]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params.has_key?(:user_id)
            #any user that has had this artwork shared to them || artwork belonging to user (done)
            artworks = {}
            authored = Artwork.find_by(artist_id: params[:user_id])
            # debugger
            artworks[:authored] = authored
            shared = Artwork.select('artworks.*').joins(:shared_viewers).where(users: { id: params[:user_id]})
            artworks[:shared] = shared
        else
            artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "artist_id" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["image_url", "sistinechapel.io"], ["artist_id", 3], ["updated_at", "2020-10-29 21:57:10.481583"], ["id", 3]]
---
    def update
        artwork = Artwork.find_by(id: params[:id])

        if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        artwork = Artwork.find_by(id: params[:id])

        if artwork.destroy